In [14]:
import pandas as pd
a = 'C:\\Users\\Dell\\Downloads\\titanic(1).csv'
df = pd.read_csv(a)
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [15]:

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [17]:
target = df.Survived
inputs=df.drop('Survived', axis='columns')

In [18]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [19]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [20]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(4)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0

In [21]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [25]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [29]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [28]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [46]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [47]:
len(x_train)

712

In [48]:

from sklearn.naive_bayes import GaussianNB

model = GaussianNB()

In [49]:
model.fit(x_train,y_train)

GaussianNB()

In [50]:
model.score(x_test,y_test)

0.776536312849162

In [51]:
x_test[:10]

     Pclass        Age     Fare  female  male
26        3  29.699118   7.2250       0     1
760       3  29.699118  14.5000       0     1
22        3  15.000000   8.0292       1     0
582       2  54.000000  26.0000       0     1
58        2   5.000000  27.7500       1     0
553       3  22.000000   7.2250       0     1
401       3  26.000000   8.0500       0     1
459       3  29.699118   7.7500       0     1
680       3  29.699118   8.1375       1     0
10        3   4.000000  16.7000       1     0

In [52]:
y_test[0:10]

26     0
760    0
22     1
582    0
58     1
553    1
401    0
459    0
680    0
10     1
Name: Survived, dtype: int64

In [53]:
model.predict(x_test[0:10])

array([0, 0, 1, 0, 1, 0, 0, 0, 1, 1], dtype=int64)

In [55]:
model.predict_proba(x_test[:10])
# first is no, and second is yes

array([[0.99002881, 0.00997119],
       [0.99004563, 0.00995437],
       [0.04474085, 0.95525915],
       [0.97081475, 0.02918525],
       [0.01246577, 0.98753423],
       [0.98877232, 0.01122768],
       [0.9895768 , 0.0104232 ],
       [0.99004191, 0.00995809],
       [0.05972189, 0.94027811],
       [0.02923286, 0.97076714]])